Documents/СписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СписаниеСРасчетногоСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Налогоплательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИИТ_ЭтапСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументПланирования</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПланированияСписанияДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументПланирования</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументПланированияСписанияДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеречислениеЗаработнойПлаты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СписаниеСРасчетногоСчета/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполненияПеречислениеЗаработнойПлаты")
Процедура АЛФ_ОбработкаПроверкиЗаполненияПеречислениеЗаработнойПлаты(Объект, ФормаПеречислениеЗаработнойПлаты, Отказ, ПроверяемыеРеквизиты)

	СообщенияПроверки = ПодготовитьСообщенияПроверкиЗаполненияПеречислениеЗаработнойПлаты(
	Объект,
	ФормаПеречислениеЗаработнойПлаты,
	Отказ,
	ПроверяемыеРеквизиты);

#Удаление
	СообщитьРезультатПроверки(
	Объект,
	Отказ,
	СообщенияПроверки,
	Метаданные.Документы.СписаниеСРасчетногоСчета.ТабличныеЧасти.ПеречислениеЗаработнойПлаты,
	ФормаПеречислениеЗаработнойПлаты);
#КонецУдаления	

КонецПроцедуры


//&ИзменениеИКонтроль("ПодготовитьПараметрыПроведения")
Функция АЛФ_ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ, ДоговорДляОтложенногоПроведения)

	ВалютаРеглУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ЭтоОтложенноеПроведение = ЗначениеЗаполнено(ДоговорДляОтложенногоПроведения);

	ПараметрыПроведения = Новый Структура;
	ПараметрыПроведения.Вставить("ВалютаРеглУчета", ВалютаРеглУчета);
	ПараметрыПроведения.Вставить("ДокументСсылка",  ДокументСсылка);
	ПараметрыПроведения.Вставить("ЭтоОтложенноеПроведение", ЭтоОтложенноеПроведение);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка",          ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ЭтоОтложенноеПроведение",         ЭтоОтложенноеПроведение);
	Запрос.УстановитьПараметр("ДоговорДляОтложенногоПроведения", ДоговорДляОтложенногоПроведения);

	ПодготовитьПараметрыРеквизитыДокумента(Запрос, ПараметрыПроведения, Отказ);

	Реквизиты = ПараметрыПроведения.ТаблицаРеквизиты[0];
	Если Отказ ИЛИ НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Дата, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;

	ПлательщикНДФЛ = УчетнаяПолитика.ПлательщикНДФЛ(Реквизиты.Организация, Реквизиты.Дата);
	ПрименяетсяАУСН = УчетнаяПолитика.ПрименяетсяАУСН(Реквизиты.Организация, Реквизиты.Дата);
	НалогАУСН = Справочники.ВидыНалоговИПлатежейВБюджет.НалогПоВиду(Перечисления.ВидыНалогов.АУСН);
	СчетАУСН = Справочники.ВидыНалоговИПлатежейВБюджет.СчетУчета(НалогАУСН, Реквизиты.Дата);

	ПараметрыПроведения.Вставить("ПлательщикНДФЛ", ПлательщикНДФЛ);
	ПараметрыПроведения.Вставить("ПрименяетсяАУСН", ПрименяетсяАУСН);

	Запрос.УстановитьПараметр("ПлательщикНДФЛ",                 ПлательщикНДФЛ);
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСН",        УчетнаяПолитика.ПрименяетсяУСН(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОрганизацияПрименяетУСНПатент",  УчетнаяПолитика.ПрименяетсяУСНПатент(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ВестиУчетПоВидамДеятельностиИП", УчетнаяПолитика.ВестиУчетПоВидамДеятельностиИП(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ОсновнаяНоменклатурнаяГруппа",   УчетнаяПолитика.ОсновнаяНоменклатурнаяГруппа(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("ДокументВВалюте",                Реквизиты.ВалютаДокумента <> ВалютаРеглУчета);
	Запрос.УстановитьПараметр("РасходыНаУслугиБанков",          ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент(
	"Справочник.ПрочиеДоходыИРасходы.РасходыНаУслугиБанков"));
	Запрос.УстановитьПараметр("ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств", УчетнаяПолитика.ИспользоватьПереводыВПутиПриПеремещенияДенежныхСредств(
	Реквизиты.Организация, Реквизиты.Дата));
	Запрос.УстановитьПараметр("РеестрВыплатСамозанятым",       Реквизиты.РеестрВыплатСамозанятым);
	Запрос.УстановитьПараметр("СчетАУСН", СчетАУСН);
	Запрос.УстановитьПараметр(
	"СодержаниеНачислениеАУСН", СтрШаблон(НСтр("ru = '%1 : начислено'"), Реквизиты.Содержание));
	Если Реквизиты.БезЗакрывающихДокументов Тогда
		Запрос.УстановитьПараметр("ОсновнойСчетУчетаЗатрат", УчетнаяПолитика.ОсновнойСчетУчетаЗатрат(
		Реквизиты.Организация, Реквизиты.Дата));
		Запрос.УстановитьПараметр("ОсновнаяСтатьяЗатрат", Справочники.СтатьиЗатрат.ОсновнаяСтатьяЗатрат());
		Запрос.УстановитьПараметр("ОсновноеПодразделение", 
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации"));
		Запрос.УстановитьПараметр("ПрочиеВнереализационныеДоходыРасходы",
		ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ПрочиеВнереализационныеДоходыРасходы"));
	КонецЕсли;

	Для каждого Колонка Из ПараметрыПроведения.ТаблицаРеквизиты.Колонки Цикл
		Запрос.УстановитьПараметр(Колонка.Имя, Реквизиты[Колонка.Имя]);
	КонецЦикла;

	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	+ ТекстЗапросаТаблицыДокумента(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПогашениеЗадолженности(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПрочееСписание(НомераТаблиц,           ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПоступлениеМПЗИП(НомераТаблиц,         ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеНалогаИП(НомераТаблиц,     ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеЗарплаты(НомераТаблиц,     ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеДепонентов(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаСчетов(НомераТаблиц,             ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаОплатаПоДоговорамПодряда(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаРегистрацияОтложенныхРасчетовСКонтрагентами(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеНДФЛ(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеДивидендов(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаВыплатыСамозанятым(НомераТаблиц,   ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаПеречислениеПоИсполнительномуЛистуРаботника(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаДанныеРазметкиАУСН(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаДанныеРасчетаНДФЛАУСН(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	+ ТекстЗапросаРазметкаАУСНБанка(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	;

	Результат = Запрос.ВыполнитьПакет();

	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;

	Если Реквизиты.ЭтоВыплатаЗарплаты Тогда
#Удаление		
		ТаблицыОплатыТруда = ПолучитьТаблицыОплатыТруда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыТруда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ПеречислениеЗарплаты", ТаблицыОплатыТруда);
		КонецЕсли;
#КонецУдаления		
	ИначеЕсли Реквизиты.ЭтоВыплатаПоДоговоруПодряда Тогда
		ТаблицыОплатыДоговоровПодряда = ПолучитьТаблицыОплатыДоговоровПодряда(ПараметрыПроведения, ДокументСсылка);
		Если ТаблицыОплатыДоговоровПодряда <> Неопределено Тогда
			ПараметрыПроведения.Вставить("ОплатаПоДоговорамПодряда", ТаблицыОплатыДоговоровПодряда);
		КонецЕсли;
	КонецЕсли;

	Реквизиты = ПараметрыПроведения.Реквизиты[0];
	Реквизиты.Содержание = ТекстСодержанияПроводокДокумента(Реквизиты);
	Если ПараметрыПроведения.РасшифровкаПлатежа <> Неопределено Тогда
		ПараметрыПроведения.РасшифровкаПлатежа.ЗаполнитьЗначения(Реквизиты.Содержание, "Содержание");
	КонецЕсли;
	Если ПараметрыПроведения.РасшифровкаПлатежаПрочее <> Неопределено Тогда
		Для Каждого Строка Из ПараметрыПроведения.РасшифровкаПлатежаПрочее Цикл
			Если Не ЗначениеЗаполнено(Строка.Содержание) Тогда
				Строка.Содержание = Реквизиты.Содержание;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат ПараметрыПроведения;

КонецФункции
